gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x8aa: file p6final.c, line 37.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:37
37  {
(gdb) n
40    input_two_string(a,b);
(gdb) s
input_two_string (a=0x7fff2d1c3510 "@", b=0x7fff2d1c3900 "\300:\034-\377\177")
    at p6final.c:5
5     printf("enter word\n");
(gdb) n
enter word
6     scanf("%s",a);
(gdb) n
name
7     printf("enter word\n");
(gdb) n
enter word
8     scanf("%s",b);
(gdb) n
letter
9   }
(gdb) c
Continuing.
name is greater than letter[Inferior 1 (process 139) exited normally]
(gdb) 